Repository: KDE/dolphin-plugins
Catalog: po/*/fileviewbazaarplugin.po
Languages: ar

# @item:inmenu
source: Bazaar Update
ar: حدّث Bazaar

# @item:inmenu
source: Bazaar Pull
ar: اجلب Bazaar

# @item:inmenu
source: Bazaar Push
ar: ادفع Bazaar

# @item:inmenu
source: Show Local Bazaar Changes
ar: اعرض تغييرات Bazaar المحليّة

# @item:inmenu
source: Bazaar Commit...
ar: إيداع Bazaar...

# @item:inmenu
source: Bazaar Add...
ar: أضف Bazaar...

# @item:inmenu
source: Bazaar Delete
ar: احذف Bazaar

# @item:inmenu
source: Bazaar Log
ar: سجل Bazaar

# @info:status
source: Updating Bazaar repository...
ar: يُحدّث مستودع Bazaar...

# @info:status
source: Update of Bazaar repository failed.
ar: أخفق تحديث مستودع Bazaar.

# @info:status
source: Updated Bazaar repository.
ar: حدّث مستودع Bazaar.

# @info:status
source: Pulling Bazaar repository...
ar: يَجلب مستودع Bazaar...

# @info:status
source: Pull of Bazaar repository failed.
ar: أخفق جلب مستودع Bazaar.

# @info:status
source: Pulled Bazaar repository.
ar: جلب مستودع Bazaar.

# @info:status
source: Pushing Bazaar repository...
ar: يَدفع مستودع Bazaar...

# @info:status
source: Push of Bazaar repository failed.
ar: أخفق دفع مستودع Bazaar.

# @info:status
source: Pushed Bazaar repository.
ar: دفع مستودع Bazaar.

# @info:status
source: Reviewing Changes...
ar: يُراجع التغييرات...

# @info:status
source: Review Changes failed.
ar: أخفقت مراجعة التغييرات.

# @info:status
source: Reviewed Changes.
ar: راجع التغييرات.

# @info:status
source: Committing Bazaar changes...
ar: يُودع تغييرات Bazaar...

# @info:status
source: Commit of Bazaar changes failed.
ar: أخفق إيداع تغييرات Bazaar.

# @info:status
source: Committed Bazaar changes.
ar: أودع تغييرات Bazaar.

# @info:status
source: Adding files to Bazaar repository...
ar: يُضيف ملفات إلى مستودع Bazaar...

# @info:status
source: Adding of files to Bazaar repository failed.
ar: أخفقت إضافة الملفات إلى مستودع Bazaar.

# @info:status
source: Added files to Bazaar repository.
ar: أضاف ملفات إلى مستودع Bazaar.

# @info:status
source: Removing files from Bazaar repository...
ar: يُزيل ملفات من مستودع Bazaar...

# @info:status
source: Removing of files from Bazaar repository failed.
ar: أخفقت إزالة الملفات من مستودع Bazaar.

# @info:status
source: Removed files from Bazaar repository.
ar: أزال ملفات من مستودع Bazaar.

# @info:status
source: Running Bazaar Log...
ar: يُشغل سجل Bazaar...

# @info:status
source: Running Bazaar Log failed.
ar: أخفق تشغيل سجل Bazaar.

# @info:status
source: Bazaar Log closed.
ar: أُغلق سجل Bazaar.
