Repository: KDE/dolphin-plugins
Catalog: po/*/fileviewhgplugin.po
Languages: ar

# @title:window
source: <application>Hg</application> Backout
ar: رجوع <application>Hg</application>

# @action:button
source: Backout
ar: رجوع

# @label:checkbox
source: Merge with old dirstate parent after backout
ar: ادمج مع أصل حالة الدليل القديم بعد الرجوع

# @label:button
source: Select Changeset
ar: اختر تسلسل التغييرات

# @label
source: Revision to Backout:
ar: المراجعة لِلرّجوع:

# @label
source: Parent Revision (optional):
ar: مراجعة الأصل (اختياري):

# @title:window
source: Select Changeset
ar: اختر تسلسل التغييرات

# @action:button
source: Select
ar: اختر

# @title:window
source: <application>Hg</application> Branch
ar: تفرّع <application>Hg</application>

source: Create New Branch
ar: أنشئ فرعًا جديدًا

source: Switch Branch
ar: بدّل الفرع

source: <b>Current Branch: </b>
ar: <b>الفرع الحالي: </b>

source: Some error occurred
ar: حدث خطأ ما

# @title:window
source: <application>Hg</application> Bundle
ar: حزمة <application>Hg</application>

# @action:button
source: Bundle
ar: حزّم

# @label
source: Base Revision (optional):
ar: المراجعة الأساسية (اختياري):

# @label
source: Bundle all changesets in repository.
ar: حزّم كل تسلسلات التغييرات في المستودع.

# @label:group
source: Options
ar: خيارات

# @label:checkbox
source: Run even when the destination is unrelated (force)
ar: شغّل حتى عندما لا يكون الهدف ذا صلة (إجبار)

# @label:checkbox
source: Do not verify server certificate
ar: لا تتحقق من شهادة الملقم

# @title:window
source: <application>Hg</application> Clone
ar: استنساخ <application>Hg</application>

# @action:button
source: Clone
ar: استنسخ

source: URLs
ar: روابط (URLs)

# @label
source: Source
ar: المصدر

# @lobel
source: Destination
ar: الوجهة

# @button
source: Browse
ar: استعرض

# @label
source: Options
ar: خيارات

source: Do not update the new working directory.
ar: لا تحدّث دليل العمل الجديد.

source: Use pull protocol to copy metadata.
ar: استخدم بروتوكول السحب لنسخ البيانات الوصفية.

source: Use uncompressed transfer.
ar: استخدم نقلاً غير مضغوط.

source: Do not verify server certificate (ignoring web.cacerts config).
ar: لا تتحقق من شهادة الملقم (مع تجاهل اضبط web.cacerts).

source: Terminating cloning!
ar: أوقف الاستنساخ!

# @action:button
source: Close
ar: أغلق

# @message:error
source: Error Cloning Repository!
ar: خطأ في استنساخ المستودع!

# @title:window
source: <application>Hg</application> Commit
ar: إيداع <application>Hg</application>

# @action:button
source: Commit
ar: إيداع

source: The KTextEditor component could not be found; please check your KDE Frameworks installation.
ar: مكوّن KTextEditor غير موجود؛ رجاءً تحقق من تثبيت أُطُر كيدي لديك.

# @action:inmenu
source: Commit to current branch
ar: أودِع إلى الفرع الحالي

# @action:inmenu
source: Create new branch
ar: أنشئ فرعًا جديدًا

# @action:inmenu
source: Close current branch
ar: أغلق الفرع الحالي

source: Copy Message
ar: انسخ الرسالة

source: Branch
ar: الفرع

# @title:group
source: Commit Message
ar: رسالة الإيداع

# @title:group
source: Diff/Content
ar: فرق/محتوى

source: Could not create branch! Aborting commit!
ar: لا أستطيع إنشاء فرع! أجهض الإيداع!

source: Commit unsuccessful!
ar: الإيداع غير ناجح!

source: No files for commit!
ar: لا ملفات للإيداع!

source: Branch: Current Branch
ar: الفرع: الفرع الحالي

source: Branch:
ar: الفرع:

source: Branch: Close Current
ar: الفرع: أغلق الحالي

# @title:window
source: <application>Hg</application> Commit: New Branch
ar: إيداع <application>Hg</application>: فرع جديد

# @label
source: Enter new branch name
ar: أدخل اسم الفرع الجديد

# @label
source: <b>Branch already exists!</b>
ar: <b>الفرع موجود بالفعل!</b>

# @label
source: <b>Enter some text!</b>
ar: <b>أدخل بعض النص!</b>

source: A KDE text-editor component could not be found; please check your KDE installation.
ar: مكوّن محرر نصوص كيدي غير موجود؛ رجاءً تحقق من تثبيت كيدي لديك.

# @title:window
source: <application>Hg</application> Repository Configuration
ar: اضبط مستودع <application>Hg</application>

# @title:window
source: <application>Hg</application> Global Configuration
ar: اضبط <application>Hg</application> العام

# @label:group
source: General Settings
ar: الإعدادات العامة

# @label:group
source: Repository Paths
ar: مسارات المستودع

# @label:group
source: Ignored Files
ar: الملفات المتجاهلة

# @label:group
source: Plugin Settings
ar: إعدادات الإضافة

# @title:window
source: <application>Hg</application> Initialize Repository
ar: هيئة <application>Hg</application> المستودع

# @action:button
source: Initialize Repository
ar: هيئة المستودع

# error message
source: Error creating repository!
ar: خطأ في إنشاء المستودع!

# @title:window
source: <application>Hg</application> Export
ar: تصدير <application>Hg</application>

# @action:button
source: Export
ar: صدّر

# @label
source: Treat all files as text
ar: عالج جميع الملفات كنص

# @label
source: Use Git extended diff format
ar: استخدم صيغة فرق Git الموسّعة

# @label
source: Omit dates from diff headers
ar: اِحذف التواريخ من ترويسات الفرق

# @message:error
source: Please select at least one changeset to be exported!
ar: رجاءً اختر تسلسل تغييرات واحد على الأقل للتصدير!

# @action:inmenu
source: <application>Hg</application> Add
ar: أضف <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Remove
ar: أزل <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Rename
ar: أعد تسمية <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Commit
ar: إيداع <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Tag
ar: وسم <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Branch
ar: تفرّع <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Clone
ar: استنساخ <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Init
ar: هيئة <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Update
ar: حدّث <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Global Config
ar: اضبط <application>Hg</application> العام

# @action:inmenu
source: <application>Hg</application> Repository Config
ar: اضبط <application>Hg</application> المستودع

# @action:inmenu
source: <application>Hg</application> Push
ar: ادفع <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Pull
ar: اسحب <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Revert
ar: ارجع <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Revert All
ar: ارجع الكل <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Rollback
ar: تراجع <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Merge
ar: ادمج <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Bundle
ar: حزمة <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Export
ar: تصدير <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Import
ar: استيراد <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Unbundle
ar: فك حزمة <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Serve
ar: اخدُم <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Backout
ar: رجوع <application>Hg</application>

# @action:inmenu
source: <application>Hg</application> Diff
ar: فرق <application>Hg</application>

# @action:inmenu
source: <application>Mercurial</application>
ar: <application>ميركوريال</application>

# @info:status
source: Adding files to <application>Hg</application> repository...
ar: أضِف الملفات إلى مستودع <application>Hg</application>...

# @info:status
source: Adding files to <application>Hg</application> repository failed.
ar: إضافة الملفات إلى مستودع <application>Hg</application> فشلت.

# @info:status
source: Added files to <application>Hg</application> repository.
ar: أُضيفَت الملفات إلى مستودع <application>Hg</application>.

# @message:yesorno
source: Would you like to remove selected files from the repository?
ar: هل ترغب في إزالة الملفات المختارة من المستودع؟

source: Remove Files
ar: أزل الملفات

# @info:status
source: Removing files from <application>Hg</application> repository...
ar: أزِل الملفات من مستودع <application>Hg</application>...

# @info:status
source: Removing files from <application>Hg</application> repository failed.
ar: إزالة الملفات من مستودع <application>Hg</application> فشلت.

# @info:status
source: Removed files from <application>Hg</application> repository.
ar: أُزيلَت الملفات من مستودع <application>Hg</application>.

# @info:status
source: Renaming of file in <application>Hg</application> repository failed.
ar: إعادة تسمية الملف في مستودع <application>Hg</application> فشلت.

# @info:status
source: Renamed file in <application>Hg</application> repository successfully.
ar: أُعيدَت تسمية الملف في مستودع <application>Hg</application> بنجاح.

# @info:status
source: Renaming file in <application>Hg</application> repository.
ar: إعادة تسمية الملف في مستودع <application>Hg</application>.

# @message
source: No changes for commit!
ar: لا تغييرات للإيداع!

# @info:status
source: Commit to <application>Hg</application> repository failed.
ar: الإيداع إلى مستودع <application>Hg</application> فشل.

# @info:status
source: Committed to <application>Hg</application> repository.
ar: أُودِعَت إلى مستودع <application>Hg</application>.

# @info:status
source: Commit <application>Hg</application> repository.
ar: إيداع مستودع <application>Hg</application>.

# @info:status
source: Tag operation in <application>Hg</application> repository failed.
ar: عملية الوسم في مستودع <application>Hg</application> فشلت.

# @info:status
source: Tagging operation in <application>Hg</application> repository is successful.
ar: عملية الوسم في مستودع <application>Hg</application> ناجحة.

# @info:status
source: Tagging operation in <application>Hg</application> repository.
ar: عملية الوسم في مستودع <application>Hg</application>.

# @info:status
source: Update of <application>Hg</application> working directory failed.
ar: تحديث دليل عمل <application>Hg</application> فشل.

# @info:status
source: Update of <application>Hg</application> working directory is successful.
ar: تحديث دليل عمل <application>Hg</application> ناجح.

# @info:status
source: Updating <application>Hg</application> working directory.
ar: حدّث دليل عمل <application>Hg</application>.

# @info:status
source: Branch operation on <application>Hg</application> repository failed.
ar: عملية التفرع على مستودع <application>Hg</application> فشلت.

# @info:status
source: Branch operation on <application>Hg</application> repository completed successfully.
ar: عملية التفرع على مستودع <application>Hg</application> اكتملت بنجاح.

# @info:status
source: Branch operation on <application>Hg</application> repository.
ar: عملية التفرع على مستودع <application>Hg</application>.

# @message:yesorno
source: Would you like to revert changes made to selected files?
ar: هل ترغب في إرجاع التغييرات التي أُجرِيَت على الملفات المختارة؟

source: Revert
ar: إرجاع

# @info:status
source: Reverting files in <application>Hg</application> repository...
ar: اِرجِع الملفات في مستودع <application>Hg</application>...

# @info:status
source: Reverting files in <application>Hg</application> repository failed.
ar: إرجاع الملفات في مستودع <application>Hg</application> فشل.

# @info:status
source: Reverting files in <application>Hg</application> repository completed successfully.
ar: إرجاع الملفات في مستودع <application>Hg</application> اكتمل بنجاح.

# @message:yesorno
source: Would you like to revert all changes made to current working directory?
ar: هل ترغب في إرجاع جميع التغييرات التي أُجرِيَت على دليل العمل الحالي؟

source: Revert All
ar: إرجاع الكل

# @info:status
source: Generating diff for <application>Hg</application> repository...
ar: اِستخرِج الفرق لمستودع <application>Hg</application>...

# @info:status
source: Could not get <application>Hg</application> repository diff.
ar: لا أستطيع الحصول على فرق مستودع <application>Hg</application>.

# @info:status
source: Generated <application>Hg</application> diff successfully.
ar: اِستُخرِجَ فرق <application>Hg</application> بنجاح.

# @message:error
source: abort: Uncommitted changes in working directory!
ar: إجهاض: تغييرات غير مُودَعَة في دليل العمل!

# @info:message
source: No rollback information available!
ar: لا معلومات عن التراجع متوفرة!

# @message:yesorno
source: Would you like to rollback last transaction?
ar: هل ترغب في التراجع عن المعاملة الأخيرة؟

source: Rollback
ar: تراجع

# @info:status
source: Executing Rollback <application>Hg</application> repository...
ar: نَفِّذ التراجع على مستودع <application>Hg</application>...

# @info:status
source: Rollback of <application>Hg</application> repository failed.
ar: التراجع عن مستودع <application>Hg</application> فشل.

# @info:status
source: Rollback of <application>Hg</application> repository completed successfully.
ar: التراجع عن مستودع <application>Hg</application> اكتمل بنجاح.

source: Dialog height
ar: ارتفاع الحوار

source: Dialog width
ar: عرض الحوار

source: Divides file list and editors with commit details
ar: اِقسِم قائمة الملفات والمحرّرات بتفاصيل الإيداع

source: Divides commit editor and diff editor
ar: اِقسِم محرر الإيداع ومحرر الفرق

# @title:window
source: <application>Hg</application> Import
ar: استيراد <application>Hg</application>

# @action:button
source: Import
ar: استورد

# @label
source: Do not commit, just update the working directory
ar: لا تودِع، فقط حدّث دليل العمل

# @label
source: Skip test for outstanding uncommitted changes
ar: تخطَّ اختبار التغييرات المعلقة غير المُودَعَة

# @label
source: Apply patch to the nodes from which it was generated
ar: طبِّق الرقعة على العُقد التي وُلِّدَت منها

# @label
source: Apply patch without touching working directory
ar: طبِّق الرقعة دون لمس دليل العمل

# @label:button
source: Add Patches
ar: أضِف الرقع

# @label:button
source: Remove Patches
ar: أزل الرقع

# @title:window
source: <application>Hg</application> Merge
ar: دمج <application>Hg</application>

# @label:button
source: Merge
ar: ادمج

# @message
source: No head selected for merge!
ar: لم يُختر رأس للدمج!

# @label:combobox
source: edit
ar: عدِّل

# @title:window
source: <application>Hg</application> Pull Repository
ar: اسحب مستودع <application>Hg</application>

# @label:checkbox
source: Update to new branch head if changesets were pulled
ar: حدّث إلى رأس الفرع الجديد إن سُحِبَت تسلسلات التغييرات

# @label:checkbox
source: Force Pull
ar: اِجبِر السحب

# @label:group
source: Incoming Changes
ar: التغييرات الواردة

# @message:info
source: No incoming changes!
ar: لا تغييرات واردة!

# @title:window
source: <application>Hg</application> Push Repository
ar: ادفع مستودع <application>Hg</application>

# @label:checkbox
source: Allow pushing a new branch
ar: اِسمح بدفع فرع جديد

# @label:checkbox
source: Force Push
ar: اِجبِر الدفع

# @label:group
source: Outgoing Changes
ar: التغييرات الصادرة

# @message:info
source: No outgoing changes!
ar: لا تغييرات صادرة!

# @title:window
source: <application>Hg</application> Rename
ar: إعادة تسمية <application>Hg</application>

# @action:button
source: Rename
ar: أعد التسمية

# @label:label to source file
source: Source
ar: المصدر

# @label:rename
source: Rename to
ar: أعد التسمية إلى

# @title:window
source: <application>Hg</application> Serve
ar: اخدُم <application>Hg</application>

# @label:button
source: Start Server
ar: اِبدأ الملقم

# @label:button
source: Stop Server
ar: أوقِف الملقم

# @label:button
source: Open in browser
ar: اِفتح في المتصفح

# @label
source: Port
ar: المنفذ

source: ## Starting Server ##
ar: ## اِبدأ الملقم ##

source: ## Server Stopped! ##
ar: ## أُوقِفَ الملقم! ##

source: Filename
ar: اسم الملف

# @title:group
source: File Status
ar: حالة الملف

# @label:button
source: Show Incoming Changes
ar: اِعرض التغييرات الواردة

# @label:button
source: Show Outgoing Changes
ar: اِعرض التغييرات الصادرة

# @action:button
source: Pull
ar: اِسحب

# @action:button
source: Push
ar: اِدفع

# @message
source: No changes found!
ar: لا تغييرات وُجِدَت!

source: Error!
ar: خطأ!

# @action:button
source: Options
ar: خيارات

# @title:window
source: <application>Hg</application> Tag
ar: وسم <application>Hg</application>

source: Create New Tag
ar: أنشئ وسمًا جديدًا

source: Remove Tag
ar: أزل وسمًا

source: Switch Tag
ar: بدّل وسمًا

source: Created tag successfully!
ar: أُنشِئَ الوسم بنجاح!

# @title:window
source: <application>Hg</application> Update
ar: تحديث <application>Hg</application>

# @action:button
source: Update
ar: حدّث

source: New working directory
ar: دليل عمل جديد

source: Tag
ar: وسم

source: Changeset/Revision
ar: تسلسل تغييرات/مراجعة

source: Current Parent
ar: الأصل الحالي

source: Options
ar: خيارات

source: Discard uncommitted changes
ar: تَخلَّص من التغييرات غير المُودَعَة

source: Some error occurred! Maybe there are uncommitted changes.
ar: حدث خطأ ما! ربما توجد تغييرات غير مُودَعَة.
