Repository: KDE/dolphin-plugins
Catalog: po/*/fileviewsvnplugin.po
Languages: ar, bg, eo

# @item:inmenu
source: SVN Update
ar: حدّث SVN
bg: Обновяване на SVN

# @item:inmenu
source: Show Local SVN Changes
ar: أرِ التغييرات المحلية لـ SVN
bg: Показване на локалните промени в SVN
eo: Montri Lokajn SVN-Ŝanĝojn

# @item:inmenu
source: SVN Commit...
ar: التزام SVN...
bg: Подаване към SVN…

# @item:inmenu
source: SVN Add
ar: أضف SVN
bg: Добавяне в SVN

# @item:inmenu
source: SVN Delete
ar: احذف SVN
bg: Изтриване от SVN
eo: SVN Forigado

# @item:inmenu
source: SVN Revert
ar: ارجع SVN
bg: Възстановяване на SVN

# @item:inmenu
source: Show SVN Updates
ar: أرِ تحديثات SVN
bg: Показване на обновленията в SVN
eo: Montri SVN-Ĝisdatigojn

# @action:inmenu
source: SVN Log...
ar: سجلّ SVN...
bg: Журнал на SVN…

# @action:inmenu
source: SVN Checkout...
ar: سحب SVN...
bg: Изтегляне от SVN…

# @action:inmenu
source: SVN Cleanup...
ar: تنظيف SVN...
bg: Изчистване на SVN…

# @info:status
source: SVN status update failed. Disabling Option "Show SVN Updates".
ar: فشل تحديث حالة SVN. تعطيل خيار "أرِ تحديثات SVN".
bg: Актуализацията на състоянието на SVN се е провалила. Деактивиране на опцията "Показване на обновленията в SVN".
eo: SVN-statusa ĝisdatigo malsukcesis. Malebliga opcio "Montri SVN-ĝisdatigojn".

# @title:window
source: SVN Update
ar: تحديث SVN
bg: Обновяване на SVN

# @info:status
source: Updating SVN repository...
ar: أحدّث مستودع SVN...
bg: Обновяване на хранилището на SVN…
eo: Ĝisdatigante SVN-deponejon...

# @info:status
source: Update of SVN repository failed.
ar: فشل تحديث مستودع SVN.
bg: Обновяване на хранилището на SVN е неуспешно
eo: Ĝisdatigo de SVN-deponejo malsukcesis.

# @info:status
source: Updated SVN repository.
ar: حدّث مستودع SVN.
bg: Хранилището на SVN е обновено.
eo: Ĝisdatigita SVN-deponejo.

# @info:status
source: Could not show local SVN changes.
ar: تعذّر إظهار التغييرات المحلية لـ SVN.
bg: Не могат да се покажат локалните промени в SVN.
eo: Ne eblis montri lokajn SVN-ŝanĝojn.

# @info:status
source: Could not show local SVN changes: svn diff failed.
ar: تعذّر إظهار التغييرات المحلية لـ SVN: فشل svn diff.
bg: Не могат да се покажат локалните промени в SVN: svn diff е неуспешно
eo: Ne eblis montri lokajn SVN-ŝanĝojn: svn diff malsukcesis.

# @info:status
source: Could not show local SVN changes: could not start kompare.
ar: تعذّر إظهار التغييرات المحلية لـ SVN: تعذّر بدء kompare.
bg: Не може да се покажат локалните промени в SVN: не може да се стартира kompare.
eo: Ne eblis montri lokajn SVN-ŝanĝojn: ne eblis lanĉi kompare.

# @info:status
source: Adding files to SVN repository...
ar: أضيف ملفات إلى مستودع SVN...
bg: Добавяне на файловете в хранилището в SVN…
eo: Aldonas dosierojn al la SVN deponejo...

# @info:status
source: Adding of files to SVN repository failed.
ar: فشل إضافة ملفات إلى مستودع SVN.
bg: Добавянето на файловете в хранилището в SVN е неуспешно.
eo: Aldono de dosieroj al SVN-deponejo malsukcesis.

# @info:status
source: Added files to SVN repository.
ar: أضفت ملفات إلى مستودع SVN.
bg: Файловете са добавени в хранилището на SVN.
eo: Aldonis dosierojn al SVN-deponejo.

# @info:status
source: Removing files from SVN repository...
ar: أزيل ملفات من مستودع SVN...
bg: Премахване на файлове от хранилището в SVN…
eo: Forigante dosierojn el SVN-deponejo...

# @info:status
source: Removing of files from SVN repository failed.
ar: فشل إزالة ملفات من مستودع SVN.
bg: Премахването на файлове от хранилището в SVN е неуспешно.
eo: Forigo de dosieroj el SVN-deponejo malsukcesis.

# @info:status
source: Removed files from SVN repository.
ar: أزلت ملفات من مستودع SVN.
bg: Файловете са премахнати от хранилището на SVN.
eo: Forigitaj dosieroj el SVN-deponejo.

# @title:window
source: SVN Revert
ar: إرجاع SVN
bg: Възстановяване на SVN
eo: SVN Reverti

# @info:status
source: Reverting files from SVN repository...
ar: أرجع ملفات من مستودع SVN...
bg: Възстановяване на файловете от хранилището в SVN…
eo: Malfarante dosierojn el SVN-deponejo...

# @info:status
source: Reverting of files from SVN repository failed.
ar: فشل إرجاع ملفات من مستودع SVN.
bg: Възстановяването на файловете от хранилището в SVN е неуспешно.
eo: Malfaro de dosieroj el SVN-deponejo malsukcesis.

# @info:status
source: Reverted files from SVN repository.
ar: أرجعت ملفات من مستودع SVN.
bg: Файловете са възстановени от хранилището на SVN.
eo: Malfaris dosierojn el SVN-deponejo.

# @info:status
source: SVN checkout: checkout in process...
ar: سحب SVN: السحب قيد المعالجة...
bg: Изтегляне от SVN: извършва се изтегляне…
eo: SVN checkout: elpreno en procezo...

# @info:status
source: SVN error starting: %1
ar: خطأ بدء SVN: %1
eo: SVN-eraro lanĉante: %1

# @info:status
source: SVN checkout: checkout failed: %1
ar: سحب SVN: فشل السحب: %1
eo: SVN checkout: elpreno malsukcesis: %1

# @info:status
source: SVN checkout: checkout successful.
ar: سحب SVN: نجح السحب.
bg: Изтегляне от SVN: изтеглянето е успешно.
eo: SVN checkout: elpreno sukcesa.

# @title:window
source: SVN Checkout
ar: سحب SVN

# @info:status
source: Reverting changes to file...
ar: أرجع تغييرات الملف...
bg: Възстановяване на промените във файла…
eo: Malfarante ŝanĝojn al dosiero...

# @info:status
source: Revert file failed.
ar: فشل إرجاع الملف.
bg: Възстановяването на файла не е успешно.
eo: Revert de dosiero malsukcesis.

# @info:status
source: File reverted.
ar: أرجِع الملف.
bg: Файлът е възстановен.
eo: Dosiero malfarita.

# @info:status
source: Could not show local SVN changes for a file: could not get file.
ar: تعذّر إظهار التغييرات المحلية لـ SVN لملف: تعذّر جلب الملف.
bg: Не може да се покажат локалните промени в SVN за даден файл: Файлът не може да се получи.
eo: Ne eblis montri lokajn SVN-ŝanĝojn por dosiero: ne eblis akiri dosieron.

# @info:status
source: Commit of SVN changes failed.
ar: فشل التزام تغييرات SVN.
bg: Неуспешно подаване на промените в SVN.
eo: Enmeto de SVN-ŝanĝoj malsukcesis.

# @title:window
source: SVN Commit
ar: التزام SVN
bg: Подаване към SVN
eo: SVN enmetado

# @info:status
source: Committing SVN changes...
ar: ألتزم تغييرات SVN...
bg: Подаване на промените в SVN…
eo: Enmetante SVN-ŝanĝojn...

# @info:status
source: Committed SVN changes.
ar: التُزِمَت تغييرات SVN.
bg: Промените в SVN са подадени.
eo: Enmetis SVN-ŝanĝoj.

source: Show updates
ar: أرِ التحديثات
bg: Показване на обновленията
eo: Montri ĝisdatigojn

# @title:window
source: Choose a directory to checkout
ar: اختر دليلاً للسحب
bg: Изберте директория за изтегляне
eo: Elekti dosierujon por elpreni

source: SVN Checkout
ar: سحب SVN
bg: Изтегляне от SVN

source: URL of repository:
ar: مسار URL للمستودع:
bg: Адрес на хранилище:
eo: URL de deponejo:

source: Checkout directory:
ar: دليل السحب:
bg: Директория на изтегляне:
eo: Elpreni dosierujon:

source: Omit externals
ar: أغفل الموارد الخارجية
bg: Пропускане на външни
eo: Preterlasi eksteraĵojn

source: OK
ar: حسنًا
bg: Добре
eo: Bone

source: Cancel
ar: ألغِ
bg: Отказ
eo: Nuligi

# @title:window
source: Choose a directory to clean up
ar: اختر دليلاً لتنظيفه
bg: Изберте директория за изчистване
eo: Elekti dosierujon por purigi

# @info:status
source: SVN clean up completed successfully.
ar: أكمل تنظيف SVN بنجاح.
bg: Изчистването на SVN е изпълнено успешно.
eo: SVN-purigo sukcese finiĝis.

# @info:status
source: SVN clean up failed for %1
ar: فشل تنظيف SVN لـ %1
bg: Неуспешно изчистване на SVN за %1
eo: SVN-purigo malsukcesis por %1

source: SVN Cleanup...
ar: تنظيف SVN...
bg: Изчистване на SVN…

source: Clean up directory:
ar: دليل التنظيف:
bg: Директория за изчистване:
eo: Purigi dosierujon:

source: Delete unversioned files and directories
ar: احذف الملفات والأدلّة غير المزوّدة بنسخ
bg: Изтриване на файлове и папки без следене на версията
eo: Forigi neversiitajn dosierojn kaj dosierujojn

source: Delete ignored files and directories
ar: احذف الملفات والأدلّة المتجاهلة
bg: Изтриване на игнорираните файлове и папки
eo: Forigi ignoritajn dosierojn kaj dosierujojn

source: Include externals
ar: أضمِن الموارد الخارجية
bg: Включване на външни
eo: Inkluzivi externals

# @label
source: Description:
ar: الوصف:
bg: Описание:
eo: Priskribo:

# @action:button
source: Refresh
ar: أنعِش
bg: Обновяване
eo: Refreŝigi

# @action:button
source: Commit
ar: التزِم
bg: Подаване
eo: Enmeti

# @item:inmenu
source: Revert
ar: إرجاع
bg: Отмяна
eo: Malfari

# @item:inmenu
source: Show changes
ar: أرِ التغييرات
bg: Показване на промените
eo: Montri ŝanĝojn

# @item:inmenu
source: Add file
ar: أضف ملفاً
bg: Добавяне на &файл
eo: Aldoni dosieron

# @title:column
source: Path
ar: المسار
bg: Път
eo: Vojo

# @title:column
source: Status
ar: الحالة
bg: Състояние
eo: Statuso

# @item:intable
source: Unversioned
ar: غير مزوّد بنسخ
bg: без следене на версията
eo: Neversiita

# @item:intable
source: Modified
ar: مُعدَّل
bg: Модифициран
eo: Modifita

# @item:intable
source: Added
ar: مُضاف
bg: Добавен
eo: Aldonita

# @item:intable
source: Deleted
ar: مَحذوف
bg: Изтрит
eo: Forigita

# @item:intable
source: Conflict
ar: تضارب
bg: Конфликт
eo: Konflikto

# @item:intable
source: Missing
ar: مفقود
bg: Липсва
eo: Mankas

# @item:intable
source: Update required
ar: يتطلب تحديثاً
bg: Изисква се обновяване
eo: Ĝisdatigo necesas

source: Update to revision
ar: حدّث إلى التنقيح
bg: Обновяване до ревизия
eo: Ĝisdatigo al revizio

source: Revert to revision
ar: ارجع إلى التنقيح
bg: Възстановяване на ревизията
eo: Reiri al revizio

source: Show changes
ar: أرِ التغييرات
bg: Показване на промените
eo: Montri ŝanĝojn

source: Changes against working copy
ar: تغييرات ضد نسخة العمل
bg: Промени спрямо работното копие
eo: Ŝanĝoj kontraŭ funkcianta kopio

# @info:status
source: SVN log: update to revision failed.
ar: سجلّ SVN: فشل التحديث إلى التنقيح.
bg: Журнал на SVN: актуализацията до ревизията е неуспешна.
eo: SVN log: ĝisdatigo al revizio malsukcesis.

# @info:status
source: SVN log: update to revision %1 successful.
ar: سجلّ SVN: نجح التحديث إلى التنقيح %1.
bg: Журнал на SVN: актуализацията до ревизия %1 е успешна.
eo: SVN log: ĝisdatigo al revizio %1 sukcesa.

# @info:status
source: SVN log: revert to revision failed.
ar: سجلّ SVN: فشل الإرجاع إلى التنقيح.
bg: Журнал на SVN: възстановяване до ревизията е неуспешно.
eo: SVN log: reiro al revizio malsukcesis.

# @info:status
source: SVN log: revert to revision %1 successful.
ar: سجلّ SVN: نجح الإرجاع إلى التنقيح %1.
bg: Журнал на SVN: възстановяване до ревизия %1 успешно.
eo: SVN log: reiro al revizio %1 sukcesa.

source: SVN Log
ar: سجلّ SVN
bg: Журнал на SVN

source: Revision
ar: التنقيح
bg: Ревизия
eo: Revizio

source: Author
ar: المؤلف
bg: Автор
eo: Aŭtoro

source: Date
ar: التاريخ
bg: Дата
eo: Dato

source: Message
ar: رسالة
bg: Съобщение
eo: Mesaĝo

source: Next 100
ar: المئة التالية
bg: Следващи 100
eo: Sekvaj 100

source: Refresh
ar: حدّث
bg: Обновяване
eo: Refreŝigi

# @info:status
source: Error starting: %1
ar: خطأ بدء: %1
bg: Грешка при стартиране на: %1
eo: Eraro lanĉante: %1
