Repository: KDE/dolphin-plugins
Catalog: po/*/fileviewgitplugin.po
Languages: ar, eo

# @title:window
source: <application>Git</application> Checkout
ar: سحب <application>جِت</application>

# @action:button
source: Checkout
ar: اسحب

# @option:radio Git Checkout
source: Branch:
ar: الفرع:
eo: Branĉo:

# @option:radio Git Checkout
source: Tag:
ar: الوسم:

# @option:radio Git Checkout
source: Commit:
ar: الإيداع:

# @title:group
source: Options
ar: خيارات
eo: Opcioj

# @option:check
source: Create New Branch:
ar: أنشئ فرعًا جديدًا:
eo: Krei Novan Filion:

# @info:tooltip
source: Create a new branch based on a selected branch or tag.
ar: أنشئ فرعًا جديدًا بناءً على فرع أو وسم مختار.
eo: Krei novan branĉon surbaze de elektita branĉo aŭ etikedo.

# @option:check
source: Force
ar: أجبر
eo: Forto

# @info:tooltip
source: Discard local changes.
ar: اِلْغِ التغييرات المحلية.
eo: Forĵeti lokajn ŝanĝojn.

# @info:tooltip
source: There are no tags in this repository.
ar: لا وسمات في هذا المستودع.
eo: Ne estas etikedoj en ĉi tiu deponejo.

# @title:group
source: Branch Base
ar: أساس الفرع
eo: Branĉa Bazo

# @title:group
source: Checkout
ar: اسحب

# @info:tooltip
source: You must enter a valid name for the new branch first.
ar: يجب عليك إدخال اسم صحيح للفرع الجديد أولاً.
eo: Vi devas unue enigi validan nomon por la nova branĉo.

# @info:tooltip
source: A branch with the name '%1' already exists.
ar: فرع بالاسم ”%1“ موجود بالفعل.
eo: Branĉo kun la nomo '%1' jam ekzistas.

# @info:tooltip
source: Branch names may not contain any whitespace.
ar: قد لا تحتوي أسماء الفروع على أي مسافات بيضاء.
eo: Branĉnomoj eble ne enhavas blankspacon.

# @info:tooltip
source: You must select a valid branch first.
ar: يجب عليك اختيار فرع صحيح أولاً.
eo: Vi devas unue elekti validan branĉon.

# @info:tooltip
source: You must enter a valid commit Id (Sha signature).
ar: يجب عليك إدخال معرّف إيداع صحيح (توقيع شا).

source: branch
ar: فرع
eo: branĉo

# a placeholder
source: a git repository url or path
ar: مسار أو رابط مستودع جِت

# @info:tooltip submodules as in git submodules
source: Recursively clone submodules
ar: انسخ الوحدات الفرعية تكراريًا

# @label:textbox
source: Url:
ar: الرابط:

# @label:textbox
source: Directory:
ar: الدليل:

# @label:textbox
source: Branch:
ar: الفرع:

# @label:textbox
source: Recursive
ar: تكراريّ

# @action:button
source: Clone
ar: انسخ

# @title:window
source: Choose a clone directory
ar: اختر دليلًا للنسخ

# @title:window
source: <application>Git</application> Clone
ar: نسخ <application>جِت</application>

# @title:window
source: <application>Git</application> Commit
ar: إيداع <application>جِت</application>

# @action:button
source: Commit
ar: أودع

# @title:group
source: Commit message
ar: رسالة الإيداع
eo: Enmet-mesaĝo

# @option:check
source: Amend last commit
ar: عدِّل الإيداع الأخير
eo: Ŝanĝi lastan enmeton

# @info:tooltip
source: There is nothing to amend.
ar: لا شيء لِتعديله.
eo: Estas nenio por modifi.

# @action:button Add Signed-Off line to the message widget
source: Sign off
ar: وقّع
eo: Elsaluti

# @info:tooltip
source: Add Signed-off-by line at the end of the commit message.
ar: أضف سطر Signed-off-by في نهاية رسالة الإيداع.
eo: Aldoni Signed-off-by linion ĉe la fino de la mesaĝo.

# @info:tooltip
source: You must enter a commit message first.
ar: يجب عليك إدخال رسالة إيداع أولاً.
eo: Vi devas unue enigi enmetomesaĝon.

source: <application>Git</application> Revert
ar: تراجع <application>جِت</application>

source: <application>Git</application> Add
ar: أضف <application>جِت</application>

source: Show Local <application>Git</application> Changes
ar: أظهر تغييرات <application>جِت</application> المحلية
eo: Montri Lokajn Ŝanĝojn de <application>Git</application>

source: <application>Git</application> Restore staged
ar: استرجع مرحّلة <application>جِت</application>
eo: <application>Git</application> Restaŭri enscenigitan

source: <application>Git</application> Remove
ar: أزِل <application>جِت</application>

source: <application>Git</application> Checkout...
ar: سحب <application>جِت</application>...

source: <application>Git</application> Commit...
ar: إيداع <application>جِت</application>...

source: <application>Git</application> Create Tag...
ar: أنشئ وسم <application>جِت</application>...

source: <application>Git</application> Push...
ar: دفعة <application>جِت</application>...

source: <application>Git</application> Pull...
ar: سحب <application>جِت</application>...

source: <application>Git</application> Merge...
ar: دمج <application>جِت</application>...

source: <application>Git</application> Clone...
ar: نسخ <application>جِت</application>...

source: <application>Git</application> Log...
ar: سجل <application>جِت</application>...

source: Adding files to <application>Git</application> repository...
ar: أضف الملفات إلى مستودع <application>جِت</application>...
eo: Aldonante dosierojn al <application>Git</application>-deponejo...

source: Adding files to <application>Git</application> repository failed.
ar: إضافة الملفات إلى مستودع <application>جِت</application> فشلت.
eo: Aldono de dosieroj al <application>Git</application>-deponejo malsukcesis.

source: Added files to <application>Git</application> repository.
ar: أضف الملفات إلى مستودع <application>جِت</application>.
eo: Aldonis dosierojn al <application>Git</application> deponejo.

source: Removing files from <application>Git</application> repository...
ar: أزِل الملفات من مستودع <application>جِت</application>...
eo: Forigante dosierojn el <application>Git</application> deponejo...

source: Removing files from <application>Git</application> repository failed.
ar: إزالة الملفات من مستودع <application>جِت</application> فشلت.
eo: Forigo de dosieroj el <application>Git</application>-deponejo malsukcesis.

source: Removed files from <application>Git</application> repository.
ar: أزِل الملفات من مستودع <application>جِت</application>.
eo: Forigis dosierojn el <application>Git</application> deponejo.

source: Reverting files from <application>Git</application> repository...
ar: تراجع عن الملفات من مستودع <application>جِت</application>...
eo: Malŝanĝante dosierojn el <application>Git</application> deponejo...

source: Reverting files from <application>Git</application> repository failed.
ar: التراجع عن الملفات من مستودع <application>جِت</application> فشل.
eo: Malŝanĝo de dosieroj el <application>Git</application> deponejo malsukcesis.

source: Reverted files from <application>Git</application> repository.
ar: تراجع عن الملفات من مستودع <application>جِت</application>.
eo: Malŝanĝis dosierojn el <application>Git</application> deponejo.

source: <application>Git</application> Log failed.
ar: سجل <application>جِت</application> فشل.
eo: <application>Git</application> Log malsukcesis.

source: <application>Git</application> Log
ar: سجل <application>جِت</application>

# Git commit hash
source: Commit
ar: الإيداع

# Git commit date
source: Date
ar: التاريخ
eo: Dato

# Git commit message
source: Message
ar: الرسالة
eo: Mesaĝo

# Git commit author
source: Author
ar: المؤلف
eo: Aŭtoro

source: Restoring staged files from <application>Git</application> repository...
ar: استرجع الملفات المرحّلة من مستودع <application>جِت</application>...
eo: Restaŭrante enscenigitajn dosierojn el <application>Git</application>-deponejo...

source: Restoring staged files from <application>Git</application> repository failed.
ar: استرجاع الملفات المرحّلة من مستودع <application>جِت</application> فشل.
eo: Restaŭro de enscenigitaj dosieroj el <application>Git</application>-deponejo malsukcesis.

source: Restoring staged files from <application>Git</application> repository.
ar: استرجع الملفات المرحّلة من مستودع <application>جِت</application>.
eo: Restaŭrante enscenigitajn dosierojn el <application>Git</application>-deponejo.

source: <application>Git</application> error starting: %1
ar: خطأ <application>جِت</application> عند البدء: %1

source: <application>Git</application> clone failed: %1
ar: نسخ <application>جِت</application> فشل: %1

source: <application>Git</application> clone complete.
ar: نسخ <application>جِت</application> اكتمل.

source: <application>Git</application> cloning repository...
ar: انسخ مستودع <application>جِت</application>...

source: Switched to branch '%1'
ar: حوّل إلى الفرع ”%1“
eo: Ŝanĝis al branĉo '%1'

source: HEAD is now at %1
ar: يشير HEAD الآن إلى %1
eo: HEAD nun estas ĉe %1

source: Switched to a new branch '%1'
ar: حوّل إلى فرع جديد ”%1“
eo: Ŝanĝis al nova branĉo '%1'

source: <application>Git</application> Checkout failed. Maybe your working directory is dirty.
ar: سحب <application>جِت</application> فشل. ربما دليل عملك غير نظيف.
eo: <application>Git</application> Kontrolo malsukcesis. Eble via labordosierujo estas malpura.

source: Successfully created tag '%1'
ar: أنشئ وسم ”%1“ بنجاح
eo: Sukcese kreis etikedon '%1'

source: <application>Git</application> tag creation failed. A tag with the name '%1' already exists.
ar: إنشاء وسم <application>جِت</application> فشل. وسم بالاسم ”%1“ موجود بالفعل.
eo: <application>Git</application> kreado de tag malsukcesis. Etikedo kun la nomo '%1' jam ekzistas.

source: <application>Git</application> tag creation failed.
ar: إنشاء وسم <application>جِت</application> فشل.
eo: <application>Git</application> kreado de tag malsukcesis.

source: Pushing branch %1 to %2:%3 failed.
ar: دفع الفرع %1 إلى %2:%3 فشل.
eo: Puŝo de branĉo %1 al %2:%3 malsukcesis.

source: Pushed branch %1 to %2:%3.
ar: دفع الفرع %1 إلى %2:%3.
eo: Puŝis branĉon %1 al %2:%3.

source: Pushing branch %1 to %2:%3...
ar: دفع الفرع %1 إلى %2:%3...
eo: Puŝante branĉon %1 al %2:%3...

source: Pulling branch %1 from %2 failed.
ar: سحب الفرع %1 من %2 فشل.
eo: Eltiri branĉon %1 el %2 malsukcesis.

source: Pulled branch %1 from %2 successfully.
ar: سحب الفرع %1 من %2 بنجاح.
eo: Eltiris branĉon %1 el %2 sukcese.

source: Pulling branch %1 from %2...
ar: سحب الفرع %1 من %2...
eo: Tirante branĉon %1 de %2...

source: Branch is already up-to-date.
ar: الفرع محدّث بالفعل.
eo: Branĉo jam estas ĝisdatigita.

source: Merge conflicts occurred. Fix them and commit the result.
ar: حدثت تعارضات دمج. أصلحها وأودع النتيجة.
eo: Kunfandaj konfliktoj okazis. Riparu ilin kaj enmetu la rezulton.

source: Dialog height
ar: ارتفاع الحوار
eo: Dialog-alteco

source: Dialog width
ar: عرض الحوار
eo: Dialog-larĝeco

# @title:window
source: <application>Git</application> Pull
ar: سحب <application>جِت</application>

# @action:button
source: Pull
ar: اسحب

# @title:group The source to pull from
source: Source
ar: المصدر
eo: Fonto

# @label:listbox a git remote
source: Remote:
ar: البُعد:
eo: Fora:

# @label:listbox
source: Remote branch:
ar: الفرع البُعد:
eo: Fora branĉo:

# @title:window
source: <application>Git</application> Push
ar: دفع <application>جِت</application>

# @action:button
source: Push
ar: اِدفع

# @title:group The remote host
source: Destination
ar: الوجهة
eo: Celo

# @title:group
source: Branches
ar: الفروع
eo: Branĉoj

# @label:listbox
source: Local Branch:
ar: الفرع المحلي:
eo: Loka Branĉo:

# @label:listbox
source: Remote Branch:
ar: الفرع البُعد:
eo: Fora Branĉo:

# @option:check
source: Force with lease
ar: إجبار مع إيجار

# @info:tooltip
source: Proceed even if the remote branch is not an ancestor of the local branch provided there were no changes in the remote branch since the last fetch.
ar: اِسْتَمِر حتى لو لَمْ يَكُن الفرع البُعد سلفًا للفرع المحلي بشرط أنه لَمْ يَكُن هناك تغييرات في الفرع البُعد منذ آخر جلب.

# @info no remote code repositories
source: No remotes defined.
ar: لا أبعاد معرّفة.

# @action:button
source: Push New Branch
ar: اِدفع فرعًا جديدًا

# @title:window
source: <application>Git</application> Create Tag
ar: إنشاء وسم <application>جِت</application>

# @action:button
source: Create Tag
ar: أنشئ وسمًا
eo: Krei Etikedon

# @title:group
source: Tag Information
ar: معلومات الوسم
eo: Etikedaj Informoj

# @label:textbox
source: Tag Name:
ar: اسم الوسم:
eo: Etikednomo:

# @label:textbox
source: Tag Message:
ar: رسالة الوسم:
eo: Etikedmesaĝo:

# @title:group
source: Attach to
ar: أرفق بـ
eo: Alkroĉigu al

# @label:listbox
source: Branch:
ar: الفرع:
eo: Branĉo:

# @info:tooltip
source: You must enter a tag name first.
ar: يجب عليك إدخال اسم وسم أولاً.
eo: Vi devas unue enigi etikednomon.

# @info:tooltip
source: Tag names may not contain any whitespace.
ar: قد لا تحتوي أسماء الوسوم على أي مسافات بيضاء.
eo: Etikednomoj eble ne enhavas blankspacon.

# @info:tooltip
source: A tag named '%1' already exists.
ar: وسم بالاسم ”%1“ موجود بالفعل.
eo: Etikedo nomita '%1' jam ekzistas.

# @info:tooltip
source: Proceed even if the remote branch is not an ancestor of the local branch.
eo: Procedu eĉ se la fora branĉo ne estas praulo de la loka branĉo.
