Repository: KDE/dolphin-plugins
Catalog: po/*/makefileactions.po
Languages: ar, eo, es, eu, fr, gl, ia, it, ko, nb, nl, pt_br, sv, tr, zh_cn, zh_tw

source: Make '%1'%2.
ar: اصنع '%1'%2.
gl: Facer «%1»%2.
ko: '%1'에 Make를 실행합니다%2.
sv: Bygg '%1'%2.
tr: Yap: “%1”%2.
zh_cn: 编译“%1”%2。

source: Makefile Actions
ar: إجراءات Makefile
eo: Makefile-Agoj
es: Acciones de Makefile
eu: «Makefile» ekintzak
fr: Actions du fichier « Makefile »
gl: Accións de Makefile
ia: Actiones de Makefile
it: Azioni Makefile
ko: Makefile 동작
nb: Makefile-handlinger
nl: Acties van Makefile
sv: Makefile-åtgärder
tr: Makefile Eylemleri
zh_cn: Makefile 操作
zh_tw: Makefile 動作

source: An error occurred while making target '%1'.
ar: وقع خطأ أثناء صنع الهدف '%1'.
eo: Okazis eraro prilaborante la celon '%1'.
es: Ha ocurrido un error al compilar el objetivo «%1».
eu: Errore bat gertatu da '%1' helburuaren «make» egitean.
fr: Une erreur est survenue durant la compilation de la cible « %1 ».
gl: Produciuse un erro ao facer o obxectivo «%1».
ia: Un error occurreva durante que il faceva objecto '%1'.
it: Si è verificato un errore durante la creazione del target «%1».
ko: '%1' 대상을 Make하는 중 오류가 발생했습니다.
nb: Det oppstod en feil ved kompilering av målet «%1».
nl: Er deed zich een fout voor tijdens het maken van doel '%1'.
pt_br: Ocorreu um erro ao criar o destino '%1'.
sv: Ett fel uppstod när målet '%1' skulle byggas.
tr: “%1” hedefi yapılırken bir hata oluştu.
zh_cn: 编译目标“%1”时发生错误。
zh_tw: 為目標 '%1' 執行 Make 時發生錯誤。

source: Running process for '%1' successfully stopped.
ar: توقف تشغيل العملية لـ '%1' بنجاح.
eo: Rulanta procezo por '%1' sukcese ĉesis.
es: El proceso en ejecución para «%1» se ha detenido correctamente.
eu: '%1'(e)rako prozesua behar bezala geldiarazi da.
fr: Le processus en cours d'exécution pour « %1 » a été arrêté avec succès.
gl: Detívose o proceso en execución de «%1».
ia: Processoexecutante per '%1' stoppate con successo.
it: Il processo in esecuzione per «%1» è stato interrotto correttamente.
ko: '%1'의 프로세스 실행이 성공적으로 정지되었습니다.
nb: Kjøring av prosessen for «%1» er stoppet.
nl: Proces uitvoeren voor '%1' is met succes gestopt.
pt_br: Processo em execução para '%1' interrompido com sucesso.
sv: Körande process för '%1' stoppades med lyckat resultat.
tr: “%1” için olan süreç başarıyla durduruldu.
zh_cn: 正在为“%1”运行的进程已经成功停止。
zh_tw: 已成功停止 '%1' 的執行中行程。

source: An error occurred trying to make target '%1'.
ar: وقع خطأ أثناء محاولة صنع الهدف '%1'.
eo: Okazis eraro provante fari celon '%1'.
es: Ha ocurrido un error al tratar de compilar el objetivo «%1».
eu: Errore bat gertatu da '%1' helburuaren «make» egiten saiatzean.
fr: Une erreur s'est produite en essayant de compiler la cible « %1 ».
gl: Produciuse un erro ao intentar facer o obxectivo «%1».
ia: Un error occurreva essayante a facer objecto '%1'.
it: Si è verificato un errore durante il tentativo di creare il target «%1».
ko: '%1' 대상에 Make를 실행하는 중 오류가 발생했습니다.
nb: Det oppsto en feil i forsøket med å kompilere målet «%1».
nl: Er is een fout opgetreden bij het maken van doel '%1'.
pt_br: Ocorreu um erro ao tentar criar o destino '%1'.
sv: Ett fel uppstod vid försök att bygga mål '%1'.
tr: “%1” hedefi yapılmaya çalışılırken bir hata oluştu.
zh_cn: 尝试编译目标“%1”时发生错误。
zh_tw: 嘗試為目標 '%1' 執行 Make 時發生錯誤。

source: &Make…
ar: ا&صنع…
gl: &Facer…
ko: Make(&M)…
sv: &Bygg…
tr: &Yap…
zh_cn: 编译(&M)…

source: Only trusted files can be used by the Makefile Actions plugin.
ar: لا يمكن استخدام إلا الملفات الموثوقة من قبل إضافة إجراءات Makefile.
eo: Nur fidindaj dosieroj povas esti uzataj de la kromaĵo Makefile Actions.
es: El complemento de acciones de Makefile solo puede usar archivos de confianza.
eu: «Makefile» ekintzen pluginak, bakarrik, konfiantza duten fitxategiak erabil ditzake.
fr: Seuls les fichiers approuvés peuvent être utilisés par le module externe « Makefile Actions ».
gl: O complemento de accións de Makefile só pode usar ficheiros de confianza.
ia: Solmente files digne de fide pote esser usate per le plugin Makefile Actions
it: Solo i file attendibili possono essere utilizzati dall'estensione Azioni Makefile.
ko: Makefile 동작 플러그인에서는 신뢰할 수 있는 파일만 사용할 수 있습니다.
nb: Bare betrodde filer kan brukes av programtillegget Makefile-handlinger.
nl: Alleen vertrouwde bestanden kunnen gebruikt worden door de plug-in Acties van Makefile.
pt_br: Somente arquivos confiáveis podem ser usados pelo plugin Makefile Actions.
sv: Bara pålitliga filer kan användas av insticksprogrammet för Makefile-åtgärder.
tr: Makefile Eylemleri eklentisi tarafından yalnızca güvenli dosyalar kullanılabilir.
zh_cn: 只有已可信任的文件可以被 Makefile 操作插件使用。
zh_tw: Makefile 動作外掛程式只會使用受信任的檔案。

source: Trusted file — uncheck to remove trust
ar: ملف موثوق — أزل التحديد لإزالة الثقة
eo: Fidinda dosiero - malmarku por forigi fidon
es: Archivo de confianza — desmárquelo para eliminar la confianza
eu: Konfiantza duen fitxategia — kendu marka konfiantza kentzeko
fr: Fichier approuvé — Décochez pour supprimer le niveau de confiance
gl: Ficheiro de confianza. Desmárqueo para retirar a confianza.
ia: File digne de fide — leva marca per remover fide
it: File attendibile: deseleziona per rimuovere l'attendibilità
ko: 신뢰할 수 있는 파일 — 체크 해제하여 신뢰 해제
nb: Betrodd fil — ta bort krysset for å fjerne tillit
nl: Vertrouwd bestand — activering verwijderen om vertrouwen te verwijderen
pt_br: Arquivo confiável — desmarque para remover a confiança
sv: Pålitlig fil — avmarkera för sluta lita på
tr: Güvenilen dosya — güveni kaldırmek için işareti kaldır
zh_cn: 已信任文件 — 取消勾选以移除信任
zh_tw: 受信任的檔案 — 取消勾選來移除信任

source: Untrusted file — check to trust
ar: ملف غير موثوق — حدد لتوثيقه
eo: Nefidinda dosiero - kontrolu por fidi
es: Archivo no fiable — márquelo para confiar en él
eu: Konfiantzarik gabeko fitxategia — markatu konfiatza emateko
fr: Fichier non approuvé — Vérifier pour donner confiance
gl: Ficheiro non de confianza. Marque para dar confianza.
ia: File non digne de fide -- marca per dar fide
it: File non attendibile — seleziona per fidarti
ko: 신뢰할 수 없는 파일 — 체크하여 신뢰
nb: Fil uten tillit — kryss av for å gjøre betrodd
nl: Niet vertrouwd bestand — activeer om te vertrouwen
pt_br: Arquivo não confiável — marque para confiar
sv: Opålitlig fil — markera för att lita på
tr: Güvenilmeyen dosya — güvenmek için işaretle
zh_cn: 不信任文件 — 勾选以添加信任
zh_tw: 不信任的檔案 — 勾選來信任

source: Dolphin Makefile Plugin
ar: إضافة Dolphin لملفات Makefile
eo: Dolphin Makefile-Kromaĵo
es: Complemento de Makefile para Dolphin
eu: Dolphin «Makefile» plugina
fr: Module externe de « Makefile » pour Dolphin
gl: Complemento de Makefile de Dolphin
it: Estensione Makefile di Dolphin
ko: Dolphin Makefile 플러그인
nb: Dolphin Makefile-tillegg
nl: Plug-in Makefile van Dolphin
pt_br: Plugin Makefile do Dolphin
sv: Dolphin Makefile-insticksprogram
tr: Dolphin Makefile Eklentisi
zh_cn: Dolphin Makefile 插件
zh_tw: Dolphin Makefile 外掛程式

source: <b>Are you sure you can trust this file?</b><br>Trusted files may execute arbitrary code on context-menu invocation.
ar: <b>هل أنت متأكد من قدرتك على الوثوق بهذا الملف؟</b><br>قد تنفذ الملفات الموثوقة رمزًا عشوائيًا عند استدعاء قائمة السياق.
eo: <b>Ĉu vi certas, ke vi povas fidi ĉi tiun dosieron?</b><br>Fiditaj dosieroj povas ruli arbitran kodon ĉe kunteksta menua alvoko.
es: <b>¿Seguro que puede fiarse de este archivo?</b><b>Los archivos de confianza pueden ejecutar código arbitrario al llamarlos desde el menú de contexto.
eu: <b>Ziur zaude fitxategi honetan konfiantza izan dezakezula?</b><br>Konfiantza duten fitxategiek, testuinguru-menua deitzen denean, kode arbitrarioa exekutatu dezakete.
fr: <b>Voulez-vous vraiment faire confiance à ce fichier ? </b><br>Les fichiers approuvés peuvent exécuter du code arbitraire lors l'invocation du menu contextuel.
gl: <b>Seguro que confía no ficheiro?</b><br>Os ficheiros de confianza poden executar código arbitrario nas invocacións do menú contextual.
ia: <b>Tu es secur que tu vole dar file a iste file?</b><br>Files digne de fide pote execurar codice arbitrari code sur invocation de menu de contexto.
it: <b>Sei sicuro di poterti fidare di questo file?</b><br>I file attendibili possono eseguire codice arbitrario all'invocazione del menu contestuale.
ko: <b>이 파일을 신뢰하시겠습니까?</b><br>신뢰하는 파일에서는 상황에 맞는 메뉴 호출 시 임의 코드를 실행할 수 있습니다.
nb: <b>Er du sikker på at du kan stole på denne fila?</b><br>Betrodde filer kan kjøre tilfeldig kode når du åpner sprettoppmenyen.
nl: <b>Wilt u dit bestand vertrouwen?</b><br>Vertrouwde bestanden kunnen willekeurige code uitvoeren bij aanroepen in het context-menu.
pt_br: <b>Tem certeza de que pode confiar neste arquivo?</b><br>Arquivos marcados como confiáveis podem executar código arbitrário na invocação do menu de contexto.
sv: <b>Är du säker på att du vill lita på filen?</b><br>Pålitliga filer kan köra godtycklig kod vid anrop från den sammanhangsberoende menyn.
tr: <b>Bu dosyaya güvenmek istediğinizden emin misiniz?</b><br>Güvenilen dosyalar, bağlam menüsüyle çağrıldıklarında istedikleri kodu yürütebilirler.
zh_cn: <b>您确定要信任此文件吗？</b><br>已信任的文件可以在右键菜单激活时执行任意代码。
zh_tw: <b>您確定可以信任這個檔案嗎？</b><br>受信任的檔案可以在內文選單觸發後執行任何程式碼。

source: Open a terminal window
ar: افتح نافذة طرفية
eo: Malfermi terminalan fenestron
es: Abrir una ventana de terminal
eu: Ireki terminal leiho bat
fr: Ouvrir une fenêtre de terminal
gl: Abrir unha xanela de terminal
ia: Aperi un fenestar de terminal
it: Apri una finestra di terminale
ko: 새 터미널 창 열기
nb: Åpne et terminalvindu
nl: Een terminalvenster openen
pt_br: Abrir uma janela de terminal
sv: Öppna ett terminalfönster
tr: Bir Uçbirim Penceresi Aç
zh_cn: 打开终端窗口
zh_tw: 開啟終端機視窗

source: Open a new terminal window to see the output of making the chosen target.
ar: افتح نافذة طرفية جديدة لترى مخرج صنع الهدف المختار.
eo: Malfermi novan terminalfenestron por vidi la eliron fari la elektitan celon.
es: Abrir una nueva ventana de terminal para ver la salida de la compilación del objetivo elegido.
eu: Ireki terminal leiho berri bat aukeratutako helburuaren «make» egitearen irteera ikusteko.
fr: Ouvrir une nouvelle fenêtre de terminal pour voir les résultats de la compilation pour la cible choisie.
gl: Abrir unha nova xanela de terminar para ver a saída de facer o obxectivo escollido.
ia: Aperi un nove fenestra de terminal per vider le exito de facer le objecto seligite.
it: Apri una nuova finestra di terminale per vedere l'output della creazione del target scelto.
ko: 새 터미널 창을 열어서 선택한 대상의 Make 출력을 표시합니다.
nb: Åpner e nytt terminalvindu for å se utdata fra kompileringen av valgt mål.
nl: Een nieuw terminalvenster openen om de uitvoer van het maken van het gekozen doel te zien.
pt_br: Abra uma nova janela de terminal para ver a saída do comando para o alvo escolhido.
sv: Öppna ett nytt terminalfönster för att se utmatningen när det valda målet byggs.
tr: Seçili hedefin yapım çıktısını görmek için bir uçbirim penceresi açın.
zh_cn: 打开一个新的终端窗口以查看编译选定目标的输出信息。
zh_tw: 開啟終端機視窗來檢視為指定目標執行 Make 的輸出。

source: Cancel running process (%1)
ar: ألغِ العملية قيد التشغيل (%1)
eo: Nuligi kurantan procezon (%1)
es: Cancelar el proceso en curso (%1)
eu: Ibiltzen ari den prozesua bertan behera utzi (%1)
fr: Annuler le processus en cours d'exécution (%1)
gl: Cancelar o proceso en execución (%1)
ia: Cancella processo executante (%1)
it: Annulla il processo in esecuzione (%1)
ko: 실행 중인 프로세스(%1) 취소
nb: Avbryt kjørende prosess (%1)
nl: Het lopende proces beëindigen (%1)
pt_br: Cancelar processo em execução (%1)
sv: Avbryt körande process (%1)
tr: Çalışan Süreci İptal Et (%1)
zh_cn: 取消正在运行的进程 (%1)
zh_tw: 取消執行中行程 (%1)

source: Interrupt the currently running process (%1).
ar: اقطع العملية قيد التشغيل حاليًا (%1).
eo: Interrompi la aktuale rulantan procezon (%1).
es: Interrumpir el proceso en curso actual (%1).
eu: Eten unean ibiltzen ari den prozesua (%1).
fr: Interrompre le processus en cours d'exécution (%1).
gl: Interromper o proceso actual en execución (%1).
ia: Interrumpe le processo currentementeexecutante (%1)
it: Interrompi il processo attualmente in esecuzione (%1).
ko: 현재 실행 중인 프로세스(%1)를 중단합니다.
nb: Drep den kjørende prosessen (%1).
nl: De nu lopende proces (%1) onderbreken.
pt_br: Interromper o processo atualmente em execução (%1).
sv: Avbryt processen som för närvarande kör (%1).
tr: Şu anda çalışan süreci yarıda kes (%1)
zh_cn: 中断当前正在运行的进程 (%1)。
zh_tw: 中斷目前執行中行程 (%1)。
